app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "this is first microposts!"], ["user_id", 1], ["created_at", "2016-01-11 18:10:58.016816"], ["updated_at", "2016-01-11 18:10:58.016816"]]
---
    def create
        @micropost = current_user.microposts.build(micropost_params)
        if @micropost.save