app/controllers/static_pages_controller.rb

  def home
    if logged_in?
    @micropost = current_user.microposts.build
    @feed_items = current_user.feed_items.includes(:user).order(created_at: :desc)
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" IN (2, 4, 5, 6, 7, 1)  ORDER BY "microposts"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (1)
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" IN (2, 4, 5, 6, 7, 1)