app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "nickname" = ?, "gender" = ?, "description" = ?, "birthday" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["nickname", "はな"], ["gender", 2], ["description", "きらめきはなこです。"], ["birthday", "2016-01-12"], ["updated_at", "2016-01-12 07:13:12.983018"], ["id", 2]]
---
  def update
    if @user.update_attributes(user_params)